src/Catalogs/Кластеры/Кластеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кластеры</name>
  <attributes>
    <name>АдресRAS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидХраненияАккаунта</name>
    <type>
      <types>EnumRef.ВидыХраненияАккаунтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.Аккаунты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортRAS</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ВидыХраненияАккаунтов/ВидыХраненияАккаунтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыХраненияАккаунтов</name>
  <enumValues>
    <name>ЛогинПароль</name>
  </enumValues>
  <enumValues>
    <name>ОбщийАккаунт</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Кластеры/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.ВидХраненияАккаунта) Тогда
		Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ПортRAS) Тогда
		Объект.ПортRAS = 1541;
	КонецЕсли;
	ОбновитьВидимостьИДоступность();
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидХраненияАккаунтаПриИзменении(Элемент)
	ОбновитьВидимостьИДоступность();
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьВидимостьИДоступность()
	Элементы.Аккаунт.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ОбщийАккаунт);
	Элементы.Логин.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль);
	Элементы.Пароль.Доступность = (Объект.ВидХраненияАккаунта = Перечисления.ВидыХраненияАккаунтов.ЛогинПароль);
КонецПроцедуры

#КонецОбласти
